INSERT INTO institutes (name)
VALUES ('Институт математики и информатики');

INSERT INTO groups (name, short_name, year, institute_id)
VALUES ('Информатика и вычислительная техника', 'Б-ИВТ-25-1', 2025, 1),
       ('Информатика и вычислительная техника', 'Б-ИВТ-25-2', 2025, 1),
       ('Фундаментальная информатика и информационные технологии', 'Б-ФИИТ-25', 2025, 1),
       ('Прикладная информатика', 'Б-ПИ-25-1', 2025, 1);

INSERT INTO students (surname, name, father_name, group_id)
VALUES ('Бояров', 'Максим', 'Николаевич', 1),
       ('Амвросьев', 'Данил', NULL, 1),
       ('Аммосова', 'Дайаана', NULL, 1),
       ('Борисов', 'Любомир', NULL, 1),
       ('Бурнашев', 'Даниил', NULL, 1),
       ('Ермолаев', 'Айсен',NULL, 1),
       ('Иванов', 'Никита', NULL, 1),
       ('Иванов', 'Эрхан', NULL, 1),
       ('Керемясов', 'Александр', NULL, 1),
       ('Климентов', 'Кэскил', NULL, 1),
       ('Леденёв', 'Никита', NULL, 1),
       ('Малышев', 'Петр', NULL, 1),
       ('Новиков', 'Ёркён', NULL, 1),
       ('Орбу', 'Артем', NULL, 1),
       ('Павлов', 'Айтал', NULL, 1),
       ('Петров', 'Кирилл', NULL, 1),
       ('Петров', 'Эльдар', NULL, 1),
       ('Седалищев', 'Александр', NULL, 1),
       ('Семенов', 'Максим', NULL, 1),
       ('Соловьев', 'Роман', NULL, 1),
       ('Софронов', 'Антон', NULL, 1),
       ('Степанов', 'Артур', NULL, 1);

SELECT * FROM institutes;

SELECT * FROM groups;

SELECT * FROM students;